resume.tex
% Created 2020-11-12 Thu 21:13
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper, 9pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\usepackage{mathpazo}
\usepackage{color}
\usepackage{enumerate}
\definecolor{bg}{rgb}{0.95,0.95,0.95}
\tolerance=1000
            \usepackage{rmk_org_cv}

\linespread{1.1}
\hypersetup{pdfborder=0 0 0}
\author{Gene Ting-Chun Kao}
\date{\today}
\title{Gene Ting-Chun Kao}
\hypersetup{
 pdfauthor={Gene Ting-Chun Kao},
 pdftitle={Gene Ting-Chun Kao},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.3 (Org mode 9.2.6)}, 
 pdflang={English}}
\begin{document}

\maketitle





\section{Personal Details:}
\label{sec:org1848a1d}
\subsection{Address:}
\label{sec:org9a29ceb}
Stefano-Franscini-Platz 1, HIB E 44, 8093 Zurich, Switzerland
\subsection{Contacts:}
\label{sec:org8621098}
phone:  +41 77 979 0661    | skype: kao.gene \\
emails: kao.gene@gmail.com | kao@arch.ethz.ch \\
\href{https://www.linkedin.com/in/kaogene/}{linkedin: kaogene} | \href{https://github.com/GeneKao}{github: GeneKao}
\subsection{Info:}
\label{sec:orgbe7ab17}
date of birth: 18.02.1990 | Nationality: Taiwan
\subsection{Website:}
\label{sec:org4191948}
www.geneatcg.com | portfolio: www.geneatcg.com/portfolio
\section{Education:}
\label{sec:orgc956930}
\subsection{2018 - present:}
\label{sec:org6a81eda}
\textbf{Dr.sc. ETH, Architecture and Structural Design} \\
\emph{Institute of Technology in Architecture, ETH Zurich, Switzerland}

Focusing on computational geometry, digital fabrication, numerical optimisation. 

\subsection{2019 - 2020:}
\label{sec:orgceeccab}
\textbf{CAS ETH in Computer Science} \\
\emph{ETH Zurich, Switzerland}

Major in Visual Computing

\subsection{2014 - 2016:}
\label{sec:org27517dc}
\textbf{M.Sc. (Dipl.Ing.), Integrated Technologies and Architectural Design Research} \\
\emph{Stuttgart University, Germany}

Multidisciplinary master studies and research of computational design, structural engineering, 
robotics, digital fabrication and construction.

\subsection{2008 - 2013:}
\label{sec:org429f5fa}
\textbf{Bachelor of Architecture (B.Arch.), Distinction} \\
\emph{Tamkang University, Taiwan}

Best thesis project award. 


\section{Work Experience}
\label{sec:org47eb068}

\subsection{09/2018 - present:}
\label{sec:org9d3a81f}
\textbf{PhD Researcher} \\
\emph{Block Rearch Group, ETH Zurich / NCCR Digital Fabrication, Switzerland}

\subsection{01/2019:}
\label{sec:org7607707}
\textbf{Teaching Assistant} \\
\emph{Massachusetts Institute of Technology, Shanghai}

\subsection{02/2017 - 07/2018:}
\label{sec:org070c299}
\textbf{Software Developer / Project Engineer} \\
\emph{Ed. Züblin AG / Strabag AG, Technical Head Office, Germany}

Worked on full-stack software solutions at the company's R\&D division 
(Digitalisation and Software Engineering, Zentrale Technik) 
to design, develop, test, deploy, and maintain both the client-side applications and the 
backend services to support various projects. 

\subsection{08/2016 - 01/2017:}
\label{sec:orgd7a9e7c}
\textbf{Student Job (Software Developement)} \\
\emph{Ed. Züblin AG / Strabag AG, Technical Head Office, Germany}

\subsection{01/2017:}
\label{sec:org7d3f500}
\textbf{Workshop Lecturer} \\
\emph{Tamkang University, Taiwan}
C\# programming, mesh processing, Leopard plugin development for Rhino/Grasshopper.

\subsection{03/2016:}
\label{sec:org9a75887}
\textbf{Workshop Teaching Assistant} \\
\emph{Stuttgart University, Germany}

C\# scripting and plugin development for Rhino/Grasshopper.

\subsection{07/2013 - 08/2014:}
\label{sec:org31d3d34}
\textbf{Research and Teaching Assistant} \\
\emph{Tamkang University, Taiwan}

Focused on digital fabrication \& computational geometry research, 
worked as TA in Computer Programming in Architectural Design and 
TKU digital fabrication lab technical support.
Designed, manufacture and build Butterfly Effect Pavilion for the I-Lan Green Expo 2014. 



\section{Cetificates:}
\label{sec:orge8daa85}

\subsection{07/2018:}
\label{sec:org4d10b84}
\textbf{Artificial Intelligence Nanodegree}, \emph{Udacity}

\subsection{05/2018:}
\label{sec:org074fa35}
\textbf{Full Stack Web Developer Nanodegree}, \emph{Udacity}

\subsection{11/2017:}
\label{sec:org695117e}
\textbf{Deep Learning Nanodegree}, \emph{Udacity}

\subsection{05/2016:}
\label{sec:orgd72f916}
\textbf{Basic Robot Programming}, \emph{KUKA Robotics}


\section{Skills}
\label{sec:orgb52e86f}
\subsection{Computer:}
\label{sec:org9b2af5e}
\textbf{Programming Languages:} \\
Python, Java, C++, C\#, JavaScript, HTML/CSS, MATLAB, Bash, Latex

\textbf{Programs:} \\
Adobe Create Suite, Rhinoceros3D, Blender

\textbf{Operating Systems:} \\
Unix/Linux, Emacs, Windows

\textbf{Others skills:} \\
Git, Org-mode, Databases, Full-stack web development, Mathemacial opitimisation, Machine learning,
Algorithms and data structures, Software developement, Computer Graphics, Computer Vision
Computational Design, Digital fabrication, Graphics design, 3D printing, Rendering, 
3D modeling, and Problem solving. 


\subsection{Language:}
\label{sec:org70afaf6}
\textbf{English:} Full professional proficiency

\textbf{Chinese:} Native

\textbf{German:} Basic


\section{Publications}
\label{sec:org0bb5c26}
\subsection{Proceedings:}
\label{sec:orgfb84571}
Kao, G.T., Körner, A., Sonntag, D., Nguyen, L., Menges, A., Knippers, J., 2017. 
Assembly-aware design of masonry shell structures: 
a computational approach, in: Proceedings of IASS Annual Symposia, 
International Association for Shell and Spatial Structures (IASS). pp. 1–10.

(This paper was presented in Pecha Kucha plenary session)
\end{document}
